#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.sandbox-2.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2]
azurerm_policy_definition.require_mfa: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/require-mfa]
module.sandbox-1.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1]
azurerm_policy_definition.allowed_regions: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-regions]
data.azurerm_subscription.current: Reading...
module.sandbox-1.data.azurerm_role_definition.vm_contributor: Reading...
azurerm_cost_anomaly_alert.cost_anomaly_alert: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.CostManagement/scheduledActions/cost-anomaly-alert]
azurerm_policy_definition.storage_encryption: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/enforce-storage-encryption]
azurerm_policy_definition.allowed_vm_sizes: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-vm-sizes]
module.sandbox-2.data.azurerm_role_definition.vm_contributor: Reading...
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1]
module.sandbox-2.azurerm_network_security_group.nsg_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-public]
module.sandbox-2.azurerm_network_security_group.nsg_private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private]
module.sandbox-2.azurerm_consumption_budget_subscription.sandbox_budget: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Consumption/budgets/sandbox-budget-sandbox-2]
module.sandbox-2.azurerm_virtual_network.sandbox_vnet: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["require-mfa"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/require-mfa-assignment-sandbox-2]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["enforce-storage-encryption"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/enforce-storage-encryption-assignment-sandbox-2]
module.sandbox-2.data.azurerm_role_definition.vm_contributor: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["allowed-regions"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/allowed-regions-assignment-sandbox-2]
module.sandbox-1.data.azurerm_role_definition.vm_contributor: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["allowed-vm-sizes"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/allowed-vm-sizes-assignment-sandbox-2]
module.sandbox-2.azurerm_subnet.public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-2.azurerm_subnet.private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-2.azurerm_network_security_rule.deny_private_outbound_all: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Deny-All-Outbound]
module.sandbox-1.azurerm_network_security_group.nsg_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-public]
module.sandbox-1.azurerm_network_security_group.nsg_private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private]
module.sandbox-1.azurerm_virtual_network.sandbox_vnet: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet]
module.sandbox-1.azurerm_consumption_budget_subscription.sandbox_budget: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Consumption/budgets/sandbox-budget-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["enforce-storage-encryption"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/enforce-storage-encryption-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["require-mfa"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/require-mfa-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["allowed-regions"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/allowed-regions-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["allowed-vm-sizes"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/allowed-vm-sizes-assignment-sandbox-1]
module.sandbox-1.azurerm_network_security_rule.deny_private_outbound_all: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Deny-All-Outbound]
module.sandbox-2.azurerm_subnet_network_security_group_association.public_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-2.azurerm_network_security_rule.allow_private_to_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Allow-Private-to-Public]
module.sandbox-2.azurerm_subnet_network_security_group_association.private_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_subnet.private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_subnet.public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-1.azurerm_subnet_network_security_group_association.public_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-1.azurerm_network_security_rule.allow_private_to_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Allow-Private-to-Public]
module.sandbox-1.azurerm_subnet_network_security_group_association.private_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sandbox-1.azurerm_automation_account.sandbox will be created
  + resource "azurerm_automation_account" "sandbox" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "eastus"
      + name                          = "automation-account-sandbox-1"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "sandbox-1"
      + sku_name                      = "Basic"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.sandbox-1.azurerm_automation_job_schedule.daily_runbook will be created
  + resource "azurerm_automation_job_schedule" "daily_runbook" {
      + automation_account_name = "automation-account-sandbox-1"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "sandbox-1"
      + resource_manager_id     = (known after apply)
      + runbook_name            = "shutdown-vms"
      + schedule_name           = "daily-runbook-schedule"
    }

  # module.sandbox-1.azurerm_automation_runbook.shutdown_vms will be created
  + resource "azurerm_automation_runbook" "shutdown_vms" {
      + automation_account_name = "automation-account-sandbox-1"
      + content                 = <<-EOT
            try {
                "Logging in to Azure..."
                Connect-AzAccount -Identity
            }
            catch {
                Write-Error -Message $_.Exception
                throw $_.Exception
            }
                
            $ResourceGroupName = "sandbox-1"
                
            $day = (Get-Date).DayOfWeek
            if ($day -eq "Saturday" -or $day -eq "Sunday") {
                Write-Output "It's $day, shutting down running VMs in $ResourceGroupName..."
                
                $runningVMs = Get-AzVM -ResourceGroupName $ResourceGroupName | Where-Object { $_.PowerState -eq "VM running" }
                foreach ($vm in $runningVMs) {
                   Stop-AzVM -Name $vm.Name -ResourceGroupName $ResourceGroupName -Force
                }
            }
            else {
                Write-Output "Today is $day. No shutdown required."
            }
        EOT
      + description             = "Runbook to shutdown running VMs on weekends."
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "eastus"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "shutdown-vms"
      + resource_group_name     = "sandbox-1"
      + runbook_type            = "PowerShell"
    }

  # module.sandbox-1.azurerm_automation_schedule.daily will be created
  + resource "azurerm_automation_schedule" "daily" {
      + automation_account_name = "automation-account-sandbox-1"
      + expiry_time             = (known after apply)
      + frequency               = "Day"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "daily-runbook-schedule"
      + resource_group_name     = "sandbox-1"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # module.sandbox-1.azurerm_role_assignment.vm_contributor will be created
  + resource "azurerm_role_assignment" "vm_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sandbox-2.azurerm_automation_account.sandbox will be created
  + resource "azurerm_automation_account" "sandbox" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "eastus"
      + name                          = "automation-account-sandbox-2"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "sandbox-2"
      + sku_name                      = "Basic"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.sandbox-2.azurerm_automation_job_schedule.daily_runbook will be created
  + resource "azurerm_automation_job_schedule" "daily_runbook" {
      + automation_account_name = "automation-account-sandbox-2"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "sandbox-2"
      + resource_manager_id     = (known after apply)
      + runbook_name            = "shutdown-vms"
      + schedule_name           = "daily-runbook-schedule"
    }

  # module.sandbox-2.azurerm_automation_runbook.shutdown_vms will be created
  + resource "azurerm_automation_runbook" "shutdown_vms" {
      + automation_account_name = "automation-account-sandbox-2"
      + content                 = <<-EOT
            try {
                "Logging in to Azure..."
                Connect-AzAccount -Identity
            }
            catch {
                Write-Error -Message $_.Exception
                throw $_.Exception
            }
                
            $ResourceGroupName = "sandbox-2"
                
            $day = (Get-Date).DayOfWeek
            if ($day -eq "Saturday" -or $day -eq "Sunday") {
                Write-Output "It's $day, shutting down running VMs in $ResourceGroupName..."
                
                $runningVMs = Get-AzVM -ResourceGroupName $ResourceGroupName | Where-Object { $_.PowerState -eq "VM running" }
                foreach ($vm in $runningVMs) {
                   Stop-AzVM -Name $vm.Name -ResourceGroupName $ResourceGroupName -Force
                }
            }
            else {
                Write-Output "Today is $day. No shutdown required."
            }
        EOT
      + description             = "Runbook to shutdown running VMs on weekends."
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "eastus"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "shutdown-vms"
      + resource_group_name     = "sandbox-2"
      + runbook_type            = "PowerShell"
    }

  # module.sandbox-2.azurerm_automation_schedule.daily will be created
  + resource "azurerm_automation_schedule" "daily" {
      + automation_account_name = "automation-account-sandbox-2"
      + expiry_time             = (known after apply)
      + frequency               = "Day"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "daily-runbook-schedule"
      + resource_group_name     = "sandbox-2"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # module.sandbox-2.azurerm_role_assignment.vm_contributor will be created
  + resource "azurerm_role_assignment" "vm_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ItsKev, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*